src/Catalogs/ЭД_Показатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЭД_Показатели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭД_Модель</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КолонкаЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_Колонки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭД_СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеМасштабируется</Name>
					<Comment>Точность отображения показателя не зависит от точности отображения документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭД_Строки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭД_ТипыЗначений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭД_Показатели/Forms/ФормаРедактированияРеквизитов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого стр Из Параметры.сзПоказатели Цикл
		
		НС = тзПоказатели.Добавить();
		НС.Показатель = стр.Значение;
		
	КонецЦикла;	
	
	МодельЭД = Параметры.МодельЭД;
	
	Если ЗначениеЗаполнено(МодельЭД) Тогда

		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "МодельЭД");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.СтрокаЭД.СвязиПараметровВыбора = НовыеСвязи;	
		Элементы.КолонкаЭД.СвязиПараметровВыбора = НовыеСвязи;	
	КонецЕсли;	
	
КонецПроцедуры       


&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	
	Для Каждого стр Из тзПоказатели Цикл
		ОповеститьОбИзменении(стр.Показатель);
	КонецЦикла;	     	
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	мРеквизиты = Новый Массив;
	мРеквизиты.Добавить("СтрокаЭД");
	мРеквизиты.Добавить("КолонкаЭД");
	мРеквизиты.Добавить("Длина");
	мРеквизиты.Добавить("Точность");
	мРеквизиты.Добавить("НеМасштабируется");
	
	ЕстьИзменения = Ложь;
	Для Каждого ИмяРеквизита Из мРеквизиты Цикл
		
		Если ЭтаФорма[ИмяРеквизита + "Выбор"] Тогда
			ЕстьИзменения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	     			
	
	Если ЕстьИзменения Тогда
		Для Каждого стрПоказатель Из тзПоказатели Цикл
			ПокОбъект = стрПоказатель.Показатель.ПолучитьОбъект();
			
			Для Каждого ИмяРеквизита Из мРеквизиты Цикл
				
				Если ЭтаФорма[ИмяРеквизита + "Выбор"] Тогда
					
					ПокОбъект[ИмяРеквизита] = ЭтаФорма[ИмяРеквизита];
					
				КонецЕсли;	
			КонецЦикла;	
			
			ПокОбъект.Записать();
			стрПоказатель.Показатель = ПокОбъект.Ссылка;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагВыбора(ИмяРеквизита)
	
	ЭтаФорма[ИмяРеквизита + "Выбор"] = Истина;

КонецПроцедуры	

&НаКлиенте
Процедура СтрокаЭДПриИзменении(Элемент)
	УстановитьФлагВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	УстановитьФлагВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТочностьПриИзменении(Элемент)
	УстановитьФлагВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НеМасштабироватьПриИзменении(Элемент)
	УстановитьФлагВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КолонкаЭДПриИзменении(Элемент)
	УстановитьФлагВыбора(Элемент.Имя);
КонецПроцедуры
